xml/request/9.user_defined_rank.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:searchRequest>
      <ns1:query>angora</ns1:query>
      <ns1:start>1</ns1:start>
      <ns1:stepValue>10</ns1:stepValue>    
      <ns1:userDefinedRanking>
        <ns1:tieValue>0.1</ns1:tieValue>
          <ns1:rankField>
            <ns1:fieldName>dc.title</ns1:fieldName>
            <ns1:fieldType>word</ns1:fieldType>
            <ns1:weight>4</ns1:weight>
          </ns1:rankField>
          <ns1:rankField>
            <ns1:fieldName>dc.title</ns1:fieldName>
            <ns1:fieldType>phrase</ns1:fieldType>
            <ns1:weight>8</ns1:weight>
          </ns1:rankField>
      </ns1:userDefinedRanking>  
    </ns1:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
